In [28]:
import pandas as pd 
df1 = pd.read_excel(r'D:\dataset\Customer Call List.xlsx')

In [29]:
# Hien thi 5 dong dau cua dataframe
df1.head()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes,False
2,1003,Walter,/White,7066950392,298 Drugs Driveway,N,NaN,True
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,True
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No,True

In [30]:
# Hien thi 5 dong cuoi cua dataframe
df1.tail()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
16,1017,Michael,Scott,123/643/9775,"121 Paper Avenue, Pennsylvania",Yes,No,False
17,1018,Clark,Kent,7066950392,3498 Super Lane,Y,NaN,True
18,1019,Creed,Braton,N/a,N/a,N/a,Yes,True
19,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True
20,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True

In [31]:
# Hien thi cac thong so co ban cua dataframe
df1.describe()

        CustomerID
count    21.000000
mean   1010.952381
std       6.127611
min    1001.000000
25%    1006.000000
50%    1011.000000
75%    1016.000000
max    1020.000000

In [32]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CustomerID         21 non-null     int64
 1   First_Name         21 non-null     object
 2   Last_Name          20 non-null     object
 3   Phone_Number       19 non-null     object
 4   Address            21 non-null     object
 5   Paying Customer    21 non-null     object
 6   Do_Not_Contact     17 non-null     object
 7   Not_Useful_Column  21 non-null     bool
dtypes: bool(1), int64(1), object(6)
memory usage: 1.3+ KB

In [33]:
# The hien kich thuoc cua dataframe
df1.shape

(21, 8)

In [34]:
# Kiem tra xem co gia tri null hay khong
df1.isnull().sum()

CustomerID           0
First_Name           0
Last_Name            1
Phone_Number         2
Address              0
Paying Customer      0
Do_Not_Contact       4
Not_Useful_Column    0
dtype: int64

In [35]:
# Kiem tra su trung lap cua cac gia tri
df1.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20     True
dtype: bool

In [36]:
# Xu ly gia tri rong
df1.dropna()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes,False
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,True
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No,True
5,1006,Ron,Swanson,304-762-2467,768 City Parkway,Yes,Yes,True
7,1008,Sherlock,Holmes,876|678|3469,98 Clue Drive,N,No,False
9,1010,Peter,Parker,123-545-5421,"25th Main Street, New York",Yes,No,True
12,1013,Don,Draper,123-543-2345,2039 Main Street,Yes,N,False
13,1014,Leslie,Knope,876|678|3469,343 City Parkway,Yes,No,False
14,1015,Toby,Flenderson_,304-762-2467,214 HR Avenue,N,No,False
15,1016,Ron,Weasley,123-545-5421,2395 Hogwarts Avenue,No,N,False
16,1017,Michael,Scott,123/643/9775,"121 Paper Avenue, Pennsylvania",Yes,No,False
18,1019,Creed,Braton,N/a,N/a,N/a,Yes,True
19,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True
20,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True

In [37]:
# Xoa cac dong co gia tri rong va trung lap va luu vao dataframe moi
df1.dropna(inplace=True)
df1.drop_duplicates(inplace = True)
df1.isna().sum()

CustomerID           0
First_Name           0
Last_Name            0
Phone_Number         0
Address              0
Paying Customer      0
Do_Not_Contact       0
Not_Useful_Column    0
dtype: int64

In [38]:
df1.columns
df1

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes,False
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,True
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No,True
5,1006,Ron,Swanson,304-762-2467,768 City Parkway,Yes,Yes,True
7,1008,Sherlock,Holmes,876|678|3469,98 Clue Drive,N,No,False
9,1010,Peter,Parker,123-545-5421,"25th Main Street, New York",Yes,No,True
12,1013,Don,Draper,123-543-2345,2039 Main Street,Yes,N,False
13,1014,Leslie,Knope,876|678|3469,343 City Parkway,Yes,No,False
14,1015,Toby,Flenderson_,304-762-2467,214 HR Avenue,N,No,False
15,1016,Ron,Weasley,123-545-5421,2395 Hogwarts Avenue,No,N,False
16,1017,Michael,Scott,123/643/9775,"121 Paper Avenue, Pennsylvania",Yes,No,False
18,1019,Creed,Braton,N/a,N/a,N/a,Yes,True
19,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True

In [39]:
import pandas as pd
df2 = pd.read_csv(r'D:\dataset\LOTR 2.csv')
df3 = pd.read_csv(r'D:\dataset\LOTR.csv')
df2 = df2.rename(columns={'FirstName': 'First Name'})
df2

   FellowshipID First Name   Age
0          1001      Frodo    50
1          1002    Samwise    39
2          1006    Legolas  2931
3          1007     Elrond  6520
4          1008   Barromir    51

In [40]:
df1.fillna('0', inplace=True)
df1['Last_Name'] = df1['Last_Name'].str.replace("_",'')
df1['Phone_Number'] = df1['Phone_Number'].str.replace(r"[_/|-]", '', regex=True)
df1['Paying Customer'] = df1['Paying Customer'].str.replace( "No",'N')
df1['Paying Customer'] = df1['Paying Customer'].str.replace( "Yes",'Y')
df1['Do_Not_Contact'] = df1['Do_Not_Contact'].str.replace( "No" ,'N')
df1['Do_Not_Contact'] = df1['Do_Not_Contact'].str.replace( "Yes" ,'Y')
df1.replace(["N/a", "n/a", "NA", "na","Na"], "0", inplace=True) 
df1 = df1.rename(columns={'Do_Not_Contact': 'Do Not Contact'})
df1 = df1.rename(columns={'Paying Customer': 'Paying Customer'})
df1 = df1.rename(columns={'Phone_Number': 'Phone Number'})
df1 = df1.rename(columns={'First_Name': 'First Name'})
df1 = df1.rename(columns={'Last_Name': 'Last Name'})
df1 = df1.rename(columns={'StateZip': 'State Zip'})
df1

,CustomerID,First Name,Last Name,Phone Number,Address,Paying Customer,Do Not Contact,Not_Useful_Column
0,1001,Frodo,Baggins,1235455421,"123 Shire Lane, Shire",Y,N,True
1,1002,Abed,Nadir,1236439775,93 West Main Street,N,Y,False
3,1004,Dwight,Schrute,1235432345,"980 Paper Avenue, Pennsylvania, 18503",Y,Y,True
4,1005,Jon,Snow,8766783469,123 Dragons Road,Y,N,True
5,1006,Ron,Swanson,3047622467,768 City Parkway,Y,Y,True
7,1008,Sherlock,Holmes,8766783469,98 Clue Drive,N,N,False
9,1010,Peter,Parker,1235455421,"25th Main Street, New York",Y,N,True
12,1013,Don,Draper,1235432345,2039 Main Street,Y,N,False
13,1014,Leslie,Knope,8766783469,343 City Parkway,Y,N,False
14,1015,Toby,Flenderson,3047622467,214 HR Avenue,N,N,False
15,1016,Ron,Weasley,1235455421,2395 Hogwarts Avenue,N,N,False
16,1017,Michael,Scott,1236439775,"121 Paper Avenue, Pennsylvania",Y,N,False
18,1019,Creed,Braton,0,0,0,Y,True
19,1020,Anakin,Skywalker,8766783469,"910 Tatooine Road, Tatooine",Y,N,True

In [52]:
import pandas as pd
df2 = pd.read_csv(r'D:\dataset\LOTR 2.csv')
df3 = pd.read_csv(r'D:\dataset\LOTR.csv')
df2 = df2.rename(columns={'FirstName': 'First Name'})
df3 = df3.rename(columns={'FirstName': 'First Name'})
print(df2)
print(df3)

   FellowshipID First Name   Age
0          1001      Frodo    50
1          1002    Samwise    39
2          1006    Legolas  2931
3          1007     Elrond  6520
4          1008   Barromir    51
   FellowshipID First Name     Skills
0          1001      Frodo     Hiding
1          1002    Samwise  Gardening
2          1003    Gandalf     Spells
3          1004     Pippin  Fireworks

In [53]:
merged_df2 = df1.merge(df2, on='First Name', how='right')
merged_df3 = df1.merge(df3, on='First Name', how='right')
print(merged_df2)

   CustomerID First Name Last Name Phone Number                Address  \
0      1001.0      Frodo   Baggins   1235455421  123 Shire Lane, Shire
1         NaN    Samwise       NaN          NaN                    NaN
2         NaN    Legolas       NaN          NaN                    NaN
3         NaN     Elrond       NaN          NaN                    NaN
4         NaN   Barromir       NaN          NaN                    NaN

  Paying Customer Do Not Contact Not_Useful_Column  FellowshipID   Age
0               Y              N              True          1001    50
1             NaN            NaN               NaN          1002    39
2             NaN            NaN               NaN          1006  2931
3             NaN            NaN               NaN          1007  6520
4             NaN            NaN               NaN          1008    51